In [1]:
import pandas as pd 
import numpy as np

In [8]:
list=[['1','sunny','sunny'],['2','cloudy','cloudy'],['3','sunny','cloudy'],['4','cloudy','cloudy'],['5','sunny','sunny'],['6','cloudy','cloudy'],['7','rainy','rainy'],['8','sunny','sunny'],['9','rainy','rainy'],['10','sunny','cloudy'],['11','cloudy','cloudy'],['12','rainy','rainy'],['13','sunny','sunny'],['14','rainy','cloudy'],['15','cloudy','rainy'],['16','sunny','sunny'],['17','cloudy','sunny'],['18','cloudy','cloudy'],['19','cloudy','rainy'],['20','sunny','sunny']]
df=pd.DataFrame(list,columns=['day','Vijayawada','Hyderabad'])
df

   day Vijayawada Hyderabad
0    1      sunny     sunny
1    2     cloudy    cloudy
2    3      sunny    cloudy
3    4     cloudy    cloudy
4    5      sunny     sunny
5    6     cloudy    cloudy
6    7      rainy     rainy
7    8      sunny     sunny
8    9      rainy     rainy
9   10      sunny    cloudy
10  11     cloudy    cloudy
11  12      rainy     rainy
12  13      sunny     sunny
13  14      rainy    cloudy
14  15     cloudy     rainy
15  16      sunny     sunny
16  17     cloudy     sunny
17  18     cloudy    cloudy
18  19     cloudy     rainy
19  20      sunny     sunny

In [28]:
length=len(df['day'])
length

20

In [29]:
c=0
for i in range (0,len(df['Vijayawada'])):
    if(df['Vijayawada'][i]=='sunny'):
        c=c+1;
c

8

In [30]:
c1=0
for i in range (0,len(df['Hyderabad'])):
    if(df['Hyderabad'][i]=='sunny'):
        c1=c1+1;
c1

7

In [31]:
p1=(c/length)*(c1/length)
p1

0.13999999999999999

In [27]:
c2=0
for i in range (0,len(df['Vijayawada'])):
    if(df['Vijayawada'][i]=='cloudy'):
        c2=c2+1;
c2

8

In [33]:
p2=(c2/length)*(c1/length)
p2

0.13999999999999999

In [34]:
c3=0
for i in range (0,len(df['Vijayawada'])):
    if(df['Vijayawada'][i]=='rainy'):
        c3=c3+1;
c3

4

In [35]:
p3=(c3/length)*(c1/length)
p3

0.06999999999999999

In [40]:
freq=df[df['Hyderabad']=='rainy'].Hyderabad.value_counts()
freq

rainy    5
Name: Hyderabad, dtype: int64

In [41]:
p4=(c3/length)*(freq/length)
p4

rainy    0.05
Name: Hyderabad, dtype: float64

In [42]:
freq1=df[df['Hyderabad']=='cloudy'].Hyderabad.value_counts()
freq1

cloudy    8
Name: Hyderabad, dtype: int64

In [43]:
p5=(c2/length)*(freq1/length)
p5

cloudy    0.16
Name: Hyderabad, dtype: float64